#### Importing

In [1]:
import pandas as pd  # Alias pandas to be referred to as pd
import numpy as np  # Alias numpy to be referred to as np
import matplotlib.pyplot as plt  # Alias matplotlib.pyplot to be referred to as plt
import seaborn as sns  # Alias seaborn to be referred to as sns
from glob import glob
import os

# Magic funtion to allow plot outputs to appear and be stored within out notebook
%matplotlib inline

import warnings
warnings.filterwarnings('ignore')

In [2]:
# Read in initial dataframes

##### pandas

In [3]:
df = pd.read_csv("data/bom.movie_gross.csv.gz")
df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [4]:
df_rt = pd.read_csv("data/rt.movie_info.tsv.gz", sep='\t')
df_rt.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [41]:
df_rt_reviews = pd.read_csv("data/rt.reviews.tsv.gz", sep='\t')
df_rt_reviews.head()

UnicodeDecodeError: 'utf-8' codec can't decode byte 0xa0 in position 6558: invalid start byte

In [5]:
rt.reviews.tsv.gz

NameError: name 'rt' is not defined

In [ ]:
tn.movie_budgets.csv.gz

In [6]:
tn_budgets_df = pd.read_csv("data/tn.movie_budgets.csv.gz")
tn_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [ ]:
tn_budgets_df.info()

In [39]:
df_1 = pd.merge(left=df_rt, right=tn_budgets_df, on="id")
df_1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4682 entries, 0 to 4681
Data columns (total 17 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 4682 non-null   int64
 1   synopsis           4508 non-null   object
 2   rating             4624 non-null   object
 3   genre              4624 non-null   object
 4   director           3874 non-null   object
 5   writer             3412 non-null   object
 6   theater_date       3299 non-null   object
 7   dvd_date           3299 non-null   object
 8   currency           1099 non-null   object
 9   box_office         1099 non-null   object
 10  runtime            4508 non-null   object
 11  studio             1563 non-null   object
 12  release_date       4682 non-null   object
 13  movie              4682 non-null   object
 14  production_budget  4682 non-null   object
 15  domestic_gross     4682 non-null   object
 16  worldwide_gross    4682 non-null   object
dtypes: int64(1), object(16)
memory usage: 658.4+ KB

In [40]:
df_1.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN,"May 29, 2009",Up,"$175,000,000","$293,004,164","$731,463,377"
2,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN,"Mar 7, 2014",Mr. Peabody & Sherman,"$145,000,000","$111,506,430","$269,806,430"
3,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN,"Dec 17, 2010",How Do You Know?,"$120,000,000","$30,212,620","$49,628,177"
4,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN,"Dec 11, 2015",In the Heart of the Sea,"$100,000,000","$25,020,758","$89,693,309"

In [ ]:
Tn.moviebudgets

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [8]:
df.describe()

       domestic_gross         year
count    3.359000e+03  3387.000000
mean     2.874585e+07  2013.958075
std      6.698250e+07     2.478141
min      1.000000e+02  2010.000000
25%      1.200000e+05  2012.000000
50%      1.400000e+06  2014.000000
75%      2.790000e+07  2016.000000
max      9.367000e+08  2018.000000

##### sqlite3 for sql dataset

In [9]:
#make sure sqlite3 is downloaded and working
#make sure sqlite db file has been unzipped
import sqlite3
sqlite3.version

'2.6.0'

In [10]:
# Create new Database

In [11]:
# Instantiate a connection
connection = sqlite3.connect("data/im.db")

In [12]:
# Instantiate a cursor
cursor = connection.cursor()

In [13]:
# sql query for list of tables
sql_query = """SELECT name FROM sqlite_master WHERE type='table';"""
cursor.execute(sql_query)
print(cursor.fetchall())

[('movie_basics',), ('directors',), ('known_for',), ('movie_akas',), ('movie_ratings',), ('persons',), ('principals',), ('writers',)]

In [14]:
# a function that should provide list of tables
def sql_fetch(con):
    """
    Function that takes in a connection, and outputs a list of tables in db
    Creates a cursor object to allow us to execute sqlite queries through Python
    Cursor executes the query that accesses the sqlite_master file and returns table names
    Fetch all names from query result
    """
    cursorObj = con.cursor()
    cursorObj.execute('SELECT name from sqlite_master where type= "table"')
    print(cursorObj.fetchall())
    
sql_fetch(connection)

[('movie_basics',), ('directors',), ('known_for',), ('movie_akas',), ('movie_ratings',), ('persons',), ('principals',), ('writers',)]

In [15]:
# Create movie_basics_df
movie_basics_df = pd.read_sql("""SELECT * FROM movie_basics""",connection)
movie_basics_df.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [16]:
movie_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [17]:
movie_basics_df.describe()

          start_year  runtime_minutes
count  146144.000000    114405.000000
mean     2014.621798        86.187247
std         2.733583       166.360590
min      2010.000000         1.000000
25%      2012.000000        70.000000
50%      2015.000000        87.000000
75%      2017.000000        99.000000
max      2115.000000     51420.000000

In [18]:
# Create moview_ratings_df with different method
movie_ratings_df = pd.read_sql_query("""SELECT * FROM movie_ratings""",connection)
movie_ratings_df.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [19]:
movie_ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

In [20]:
movie_ratings_df.describe()

       averagerating      numvotes
count   73856.000000  7.385600e+04
mean        6.332729  3.523662e+03
std         1.474978  3.029402e+04
min         1.000000  5.000000e+00
25%         5.500000  1.400000e+01
50%         6.500000  4.900000e+01
75%         7.400000  2.820000e+02
max        10.000000  1.841066e+06

#### Cleaning

In [21]:
# Dataframes:

#   df
#   movie_basics_df
#   movie_ratings_df

In [22]:
# Check for duplicates
print(movie_basics_df.duplicated().any())
print(movie_ratings_df.duplicated().any())

False
False

In [23]:
# Return the count of placeholder values
movie_basics_df.isin(['?', '#', 'NaN', 'null', 'N/A', '-', 0]).sum()

movie_id           0
primary_title      0
original_title     0
start_year         0
runtime_minutes    0
genres             0
dtype: int64

In [24]:
# Return the count of placeholder values
movie_ratings_df.isin(['?', '#', 'NaN', 'null', 'N/A', '-', 0]).sum()

movie_id         0
averagerating    0
numvotes         0
dtype: int64

##### merge imdb tables

In [25]:
# Merge sqlite3 tables to make pandas DataFrame (pandas & sqlite)
join_movie_id = """SELECT * 
FROM movie_basics
INNER JOIN movie_ratings
ON movie_basics.movie_id = movie_ratings.movie_id
"""

In [26]:
imdb_df = pd.DataFrame(cursor.execute(join_movie_id).fetchall())
imdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       73856 non-null  object
 1   1       73856 non-null  object
 2   2       73856 non-null  object
 3   3       73856 non-null  int64
 4   4       66236 non-null  float64
 5   5       73052 non-null  object
 6   6       73856 non-null  object
 7   7       73856 non-null  float64
 8   8       73856 non-null  int64
dtypes: float64(2), int64(2), object(5)
memory usage: 5.1+ MB

##### merge imdb tables (pandas only)

In [27]:
# Merge imdb data
imdb_df = pd.merge(left=movie_basics_df, right=movie_ratings_df, on="movie_id")
imdb_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 73856 entries, 0 to 73855
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   movie_id         73856 non-null  object
 1   primary_title    73856 non-null  object
 2   original_title   73856 non-null  object
 3   start_year       73856 non-null  int64
 4   runtime_minutes  66236 non-null  float64
 5   genres           73052 non-null  object
 6   averagerating    73856 non-null  float64
 7   numvotes         73856 non-null  int64
dtypes: float64(2), int64(2), object(4)
memory usage: 5.1+ MB

In [28]:
imdb_df.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119

In [29]:
imdb_df. rename(columns = {"primary_title":"title"}, inplace = True)
imdb_df.head()

,movie_id,title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119

In [30]:
# Make super_df with most merged data
super_df = pd.merge(left=df, right=imdb_df, on="title")
super_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3027 entries, 0 to 3026
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   title            3027 non-null   object
 1   studio           3024 non-null   object
 2   domestic_gross   3005 non-null   float64
 3   foreign_gross    1832 non-null   object
 4   year             3027 non-null   int64
 5   movie_id         3027 non-null   object
 6   original_title   3027 non-null   object
 7   start_year       3027 non-null   int64
 8   runtime_minutes  2980 non-null   float64
 9   genres           3020 non-null   object
 10  averagerating    3027 non-null   float64
 11  numvotes         3027 non-null   int64
dtypes: float64(3), int64(3), object(6)
memory usage: 307.4+ KB

In [31]:
super_df = super_df.merge(tn_budgets_df, left_on='title', right_on='movie')
super_df.info()

#frame_1.merge(frame_2, left_on='county_ID', right_on='countyid')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1413 entries, 0 to 1412
Data columns (total 18 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   title              1413 non-null   object
 1   studio             1413 non-null   object
 2   domestic_gross_x   1412 non-null   float64
 3   foreign_gross      1215 non-null   object
 4   year               1413 non-null   int64
 5   movie_id           1413 non-null   object
 6   original_title     1413 non-null   object
 7   start_year         1413 non-null   int64
 8   runtime_minutes    1383 non-null   float64
 9   genres             1406 non-null   object
 10  averagerating      1413 non-null   float64
 11  numvotes           1413 non-null   int64
 12  id                 1413 non-null   int64
 13  release_date       1413 non-null   object
 14  movie              1413 non-null   object
 15  production_budget  1413 non-null   object
 16  domestic_gross_y   1413 non-null   object
 17  worldwide_gross    1413 non-null   object
dtypes: float64(3), int64(4), object(11)
memory usage: 209.7+ KB

In [32]:
super_df.head()

,title,studio,domestic_gross_x,foreign_gross,year,movie_id,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,id,release_date,movie,production_budget,domestic_gross_y,worldwide_gross
0,Toy Story 3,BV,415000000.0,652000000,2010,tt0435761,Toy Story 3,2010,103.0,"Adventure,Animation,Comedy",8.3,682218,47,"Jun 18, 2010",Toy Story 3,"$200,000,000","$415,004,880","$1,068,879,522"
1,Inception,WB,292600000.0,535700000,2010,tt1375666,Inception,2010,148.0,"Action,Adventure,Sci-Fi",8.8,1841066,38,"Jul 16, 2010",Inception,"$160,000,000","$292,576,195","$835,524,642"
2,Shrek Forever After,P/DW,238700000.0,513900000,2010,tt0892791,Shrek Forever After,2010,93.0,"Adventure,Animation,Comedy",6.3,167532,27,"May 21, 2010",Shrek Forever After,"$165,000,000","$238,736,787","$756,244,673"
3,The Twilight Saga: Eclipse,Sum.,300500000.0,398000000,2010,tt1325004,The Twilight Saga: Eclipse,2010,124.0,"Adventure,Drama,Fantasy",5.0,211733,53,"Jun 30, 2010",The Twilight Saga: Eclipse,"$68,000,000","$300,531,751","$706,102,828"
4,Iron Man 2,Par.,312400000.0,311500000,2010,tt1228705,Iron Man 2,2010,124.0,"Action,Adventure,Sci-Fi",7.0,657690,15,"May 7, 2010",Iron Man 2,"$170,000,000","$312,433,331","$621,156,389"

In [38]:
super_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1413 entries, 0 to 1412
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   title              1413 non-null   object
 1   studio             1413 non-null   object
 2   domestic_gross_x   1412 non-null   float64
 3   foreign_gross      1215 non-null   object
 4   year               1413 non-null   int64
 5   runtime_minutes    1383 non-null   float64
 6   genres             1406 non-null   object
 7   averagerating      1413 non-null   float64
 8   numvotes           1413 non-null   int64
 9   id                 1413 non-null   int64
 10  release_date       1413 non-null   object
 11  movie              1413 non-null   object
 12  production_budget  1413 non-null   object
 13  domestic_gross_y   1413 non-null   object
 14  worldwide_gross    1413 non-null   object
dtypes: float64(3), int64(3), object(9)
memory usage: 176.6+ KB

In [33]:
super_df.isnull().sum()

title                  0
studio                 0
domestic_gross_x       1
foreign_gross        198
year                   0
movie_id               0
original_title         0
start_year             0
runtime_minutes       30
genres                 7
averagerating          0
numvotes               0
id                     0
release_date           0
movie                  0
production_budget      0
domestic_gross_y       0
worldwide_gross        0
dtype: int64

##### make clean_df

In [34]:
# Now clean super_df 

# GOALS

# remove foreign_gross, original_title, movie_id, start_year 
# base on runtime_minutes count

In [35]:
super_df.drop(["original_title", "movie_id", "start_year"], axis=1, inplace=True)

In [36]:
super_df.head()

,title,studio,domestic_gross_x,foreign_gross,year,runtime_minutes,genres,averagerating,numvotes,id,release_date,movie,production_budget,domestic_gross_y,worldwide_gross
0,Toy Story 3,BV,415000000.0,652000000,2010,103.0,"Adventure,Animation,Comedy",8.3,682218,47,"Jun 18, 2010",Toy Story 3,"$200,000,000","$415,004,880","$1,068,879,522"
1,Inception,WB,292600000.0,535700000,2010,148.0,"Action,Adventure,Sci-Fi",8.8,1841066,38,"Jul 16, 2010",Inception,"$160,000,000","$292,576,195","$835,524,642"
2,Shrek Forever After,P/DW,238700000.0,513900000,2010,93.0,"Adventure,Animation,Comedy",6.3,167532,27,"May 21, 2010",Shrek Forever After,"$165,000,000","$238,736,787","$756,244,673"
3,The Twilight Saga: Eclipse,Sum.,300500000.0,398000000,2010,124.0,"Adventure,Drama,Fantasy",5.0,211733,53,"Jun 30, 2010",The Twilight Saga: Eclipse,"$68,000,000","$300,531,751","$706,102,828"
4,Iron Man 2,Par.,312400000.0,311500000,2010,124.0,"Action,Adventure,Sci-Fi",7.0,657690,15,"May 7, 2010",Iron Man 2,"$170,000,000","$312,433,331","$621,156,389"

In [42]:
super_df.columns

Index(['title', 'studio', 'domestic_gross_x', 'foreign_gross', 'year',
       'runtime_minutes', 'genres', 'averagerating', 'numvotes', 'id',
       'release_date', 'movie', 'production_budget', 'domestic_gross_y',
       'worldwide_gross'],
      dtype='object')

In [37]:
# https://www.machinelearningplus.com/pandas/pandas-dropna-how-to-drop-missing-values/#:~:text=Dropping%20rows%20if%20missing%20values,names%20to%20the%20subset%20parameter.

In [ ]:
clean_df = super_df.dropna(subset=['runtime_minutes'])
clean_df.info()

In [ ]:
clean_df = clean_df.dropna(subset=['domestic_gross'])
clean_df.info()

In [ ]:
clean_df = clean_df.dropna(subset=['genres'])
clean_df.info()

In [ ]:
clean_df = clean_df.dropna(subset=['studio'])
clean_df.info()

##### clean_df pairplot

In [ ]:
# view distributions of numeric variables
sns.pairplot(clean_df)

In [ ]:
cols = list(clean_df.columns)
cols = cols[1:]

In [ ]:
cols

##### clean_df pairplot categorical

In [ ]:
sns.pairplot(clean_df, vars=cols)

Initially this plot may seem like a mistake, but this pairplot yields valuable information. Considering that our dataframe is ordered by `domestic_gross`(descending):

- The shape of the year by studio plot indicates that over the past 8 years there has been an increase in the number of film studios.
- There is also a dramtic increase in genre diversity in the most recent years.
-

#### Explore

##### genre

In [ ]:
# get max domestic gross per year. 
# Is there a trend of increasing domestic gross in film industry?

# If yes, what are characteristics of film industry?

# If no, what are the reasons?

In [ ]:
top_gross = clean_df.sort_values(by="domestic_gross", ascending=False)
top_gross.head(10)

In [ ]:
# How new is the data
top_gross["year"].max()

In [ ]:
# What is the hightest rating
top_gross["averagerating"].max()

In [ ]:
# Which movie has the highest rating
top_gross.loc[top_gross['averagerating'].idxmax()]

In [ ]:
print(clean_df["genres"].unique())

In [ ]:
print(clean_df["genres"].nunique())

In [ ]:
top_gross["genres"] = top_gross["genres"].apply(lambda x: x.split(",") if x else x)
top_gross.head()

In [ ]:

dataframe.fillna(value, method, axis, inplace, limit, downcast)

In [ ]:
all_genres = set()

for genres in top_gross["genres"]:
    if genres:
        all_genres.update(genres)

all_genres

In [ ]:
# Iterate through the set.
for genre in all_genres:
    # Make a new column in dataframe and fill the columns with zeros.
    top_gross[genre] = np.zeros(shape=top_gross.shape[0])
# Check that the changes took place.                                
top_gross.head()

In [ ]:
# Iterate through the genres column as an index
# the genre rows. 
for index, row in top_gross.iterrows():
    # If the value in genres
    if row['genres']:
        # mathces a genre column
        for genre in row['genres']:
            # change that value to 1.
            top_gross.loc[index, genre] = 1
# Lets check our changes.
top_gross.head()

In [ ]:
# Lets make a list of all the genres. First make a list of all the columns of the dataframe.
cols = list(top_gross.columns)

In [ ]:
# Now index those columns that are associated with the genres and assign them a new name.
genre_cols = cols[8:]

In [ ]:
# Create a new dictionary
genre_count = {}
# Iterate through the columns associated with genres, setting the name of the
# column as the keys in the dictionary.
for col in genre_cols:
    # Get the total of all the genre counts where the value equaled 1,
    # which we set previously
    count = np.sum(top_gross[col] == 1).sum()
    # Set the values of the dictionary equal to the total of the counts
    genre_count[col] = count

In [ ]:
genre_count

In [ ]:
len(genre_count)

In [ ]:
list(genre_count)[0]

In [ ]:
# https://stackoverflow.com/questions/27263805/pandas-column-of-lists-create-a-row-for-each-list-element

In [ ]:
clean_df_explode = top_gross.explode("genres")
clean_df_explode

In [ ]:
# https://stackoverflow.com/questions/63045171/how-to-sum-values-of-one-column-based-on-other-columns-in-pandas

In [ ]:
genre_gross_df = clean_df_explode.groupby('genres')['domestic_gross'].sum() / clean_df_explode['genres'].value_counts()
genre_gross_df.describe()

Here we can see the average gross descriptive statistics for our data.

In [ ]:
# Create a plot and define its size.
plt.figure(figsize=(20, 10))
# Draw a seaborn boxplot based on the Adventure genre and production budgets
sns.boxplot(clean_df_explode['genres'], clean_df_explode['domestic_gross'], palette="winter")
# Set title of plot
plt.title('Distribution of Domestic Gross by Genre')
# Set x-axis label and font size
plt.xlabel('Genre', fontsize=15)
# Set y-axis label
plt.ylabel('Domestic Gross in USD')
# Remove scientific notation from y-axis tick labels
plt.ticklabel_format(style='plain', axis='y')

# Show the plot
plt.show()

In [ ]:
clean_df_explode['genres'].value_counts()

In [ ]:
# Create a plot and define its size.
plt.figure(figsize=(20, 10))
# Draw a seaborn boxplot based on the Adventure genre and production budgets
sns.boxplot(clean_df_explode['genres'], clean_df_explode['averagerating'], palette="Wistia")
# Set title of plot
plt.title('Distribution of Average Rating by Genre')
# Set x-axis label and font size
plt.xlabel('Genre', fontsize=15)
# Set y-axis label
plt.ylabel('Average Rating')
# Remove scientific notation from y-axis tick labels
plt.ticklabel_format(style='plain', axis='y')

# Show the plot
plt.show()

In [ ]:
# Create a list of the dictionary keys
keys = list(genre_count.keys())
# Create a list of the dictionary values
values = list(genre_count.values())

In [ ]:
#https://stackoverflow.com/questions/56360610/sum-column-based-on-another-column-in-pandas-dataframe

In [ ]:
# Create new column based on funder occurrences.
clean_df['genre_totals'] = clean_df.domestic_gross.groupby(clean_df.genres).transform('sum')

## Practice with new value

In [ ]:
df = pd.read_csv('zippedData.zip',compression='zip')

In [ ]:
# import required modules
import zipfile
import pandas as pd
 
# open zipped dataset
with zipfile.ZipFile("test.zip") as z:
   # open the csv file in the dataset
   with z.open("test.csv") as f:
       
      # read the dataset
      train = pd.read_csv(f)
       
      # display dataset
      print(train.head())

In [ ]:
clean_df.head()

In [ ]:
bv_studio = clean_df["studio"]

In [ ]:
# Define our binning function
def group_studio():
    if studio[] == 'BV':
        return [].mean()

In [ ]:
# Define our binning function
def group_zip(coor):
    """
    Takes in coordinates, and applies conditionals to lat and long to return the appropriate region the coordinate lies in.
    """
    if coor[0] > 47.5 and coor[1] < -122.1:
        return 'NW'
    elif coor[0] < 47.5 and coor[1] < -122.1:
        return 'SW'
    elif coor[0] > 47.5 and coor[1] > -122.1:
        return 'NE'
    else:
        return 'SE'

# Create new feature based on the values returned from function
dumb_coor_df['zip_group'] = dumb_coor_df['coordinate'].apply(group_zip)

In [ ]:
# Create lists of the seasons with months as elements
short_rain = [11, 12]
long_rain = [3, 4, 5]
short_dry = [1, 2]
long_dry = [6, 7, 8, 9, 10]

# Create a function that bins the months reported by season
def season(mon):
    """
    Takes in month, and applies in logical to determine season of sale.
    """
    if mon in short_rain:
        return 'short_rain'
    elif mon in long_rain:
        return 'long_rain'
    elif mon in short_dry:
        return 'short_dry'
    else:
        return 'long_dry'

# Create new feature based on the values returned from function
train_df['seas_recorded'] = train_df['month_recorded'].apply(season)

In [ ]:
mean_val = df.groupby("Show")["Time_watched"].transform("mean")
df["Completed"] = (
    df["Completed"].fillna((df["Time_watched"] > mean_val)).astype(int)
)

In [ ]:
Output:

           Show  Time_watched  Completed
0           GOT           400          1
1    The Office           424          1
2  Breaking Bad           325          0
3           GOT           325          0
4    The Office           344          0
5  Breaking Bad           325          1

First, calculate the mean by show using groupby with transform then, compare that each value, and fillna.

Quantile 75%

Try this:

In [ ]:
mean_val = clean_df.groupby("studio")["domestic_gross"].transform("mean")
print(mean_val)

In [ ]:
clean_df["num_rating"] =

In [ ]:

df["Completed"] = (
    df["Completed"].fillna((df["Time_watched"] > mean_val)).astype(int)
)

q75 = df.groupby("Show")["Time_watched"].transform(pd.Series.quantile, q=.75)
df['Complete'] = df["Completed"].fillna((df["Time_watched"] > q75)).astype(int)

In [ ]:
df = pd.read_csv("rt-Copy1.reviews.csv")

In [ ]:
# manually impute missing values with numpy
from pandas import read_csv
from numpy import nan
# load the dataset
dataset = read_csv('pima-indians-diabetes.csv', header=None)
# mark zero values as missing or NaN
dataset[[1,2,3,4,5]] = dataset[[1,2,3,4,5]].replace(0, nan)
# fill missing values with mean column values
dataset.fillna(dataset.mean(), inplace=True)
# count the number of NaN values in each column
print(dataset.isnull().sum())

In [ ]:
if df["rating_num"][movie] == None:
    df["rating_num"].fillna(median)

In [ ]:
clean_df['studio_avg'] = np.where((top_gross['studio'] == 'BV'), 1, np.nan)

In [ ]:
# Create new column based on funder occurrences.
clean_df['genre_avg_gross'] = clean_df.domestic_gross.groupby(clean_df.genres).transform('sum')/clean_df.domestic_gross.groupby(clean_df.genres).transform('count')
clean_df.head(10)

In [ ]:
gross_genre_df = clean_df.sort_values(by="genre_avg_gross", ascending=False)
gross_genre_df.head(10)

In [ ]:
# Create a new dictionary
genre_count = {}
# Iterate through the columns associated with genres, setting the name of the
# column as the keys in the dictionary.
for col in genre_cols:
    # Get the total of all the genre counts where the value equaled 1,
    # which we set previously
    count = np.sum(top_gross[col] == 1).sum()
    # Set the values of the dictionary equal to the total of the counts
    genre_count[col] = count

In [ ]:
gross_genre_df = gross_genre_df.drop_duplicates(subset='genres', keep="first")

In [ ]:
gross_genre_df.head(10)

In [ ]:
# Set the style of the seaborn plot to have a white background with gray lines. 
#sns.set(style="whitegrid")
# Set the scale plot to be larger and easier to read.
#sns.set_context("talk")
# Create a plot and size it appropriately for information shown
plt.figure(figsize=(12,10))
# Draw the seaborn barplot
sns.barplot(y = keys, x = values, alpha=0.8, palette="deep")
# Set the barplot's title.
plt.title('Films by Genre')
# Label the y-axis
plt.ylabel('Genre', fontsize=20)
# Label the x-axis
plt.xlabel('Count', fontsize=20)

# Show the plot                
plt.show()

In [ ]:
# Interesting to get the average domestic gross of each genre

In [ ]:
# Create correlation dataframe
cor_df = clean_df.corr(method = "pearson").round(2)
cor_df

In [ ]:
# Create a seaborn heatmap to show correlations
fig, ax = plt.subplots(figsize=(20,15))
cmap = sns.diverging_palette(150, 275, s=80, l=55, n=9, as_cmap=True)
sns.heatmap(cor_df, center=0, cmap=cmap, robust=True)

In [ ]:
# https://medium.com/the-researchers-guide/generate-numerical-correlation-and-nominal-association-plots-using-python-c8548aa4a663
# pip install dython
# using dython library
from dython.nominal import associations
# Step 1: Instantiate a figure and axis object
fig, ax = plt.subplots(figsize=(16, 8))
# Step 2: Creating a pair-wise correlation plot 
# Saving it into a variable(r)
r = associations(clean_df, ax = ax, cmap = "Blues")

In [ ]:
r["corr"].round(2)

In [ ]:
# Using association_metrics library
import association_metrics as am
# Convert object columns to Category columns
df = clean_df.apply(
        lambda x: x.astype("category") if x.dtype == "O" else x)
# Initialize a CramersV object using the pandas.DataFrame (df)
cramers_v = am.CramersV(df)
# It will return a pairwise matrix filled with Cramer's V, where 
# columns and index are the categorical variables of the passed     # pandas.DataFrame
cfit = cramers_v.fit().round(2)
cfit

In [ ]:
# boxplot of domestic_gross by year

In [ ]:
# Create a plot and define its size.
plt.figure(figsize=(12, 10))
# Draw a seaborn boxplot based on the Adventure genre and production budgets
sns.boxplot(x=clean_df["year"],
            y=clean_df['domestic_gross'], palette="Set2")
# Set title of plot
plt.title('Distribution of Domestic Gross by Year')
# Set x-axis label and font size
plt.xlabel('Year', fontsize=15)
# Set y-axis label
plt.ylabel('Domestic Gross in USD')
# Remove scientific notation from y-axis tick labels
plt.ticklabel_format(style='plain', axis='y')

# Show the plot
plt.show()

In [ ]:
aas = clean_df[clean_df['genres'] == 'Action,Adventure,Sci-Fi']
aas.head()

In [ ]:
clean_df.head()

In [ ]:
aas.describe()

In [ ]:
aas["domestic_gross"].plot.box()

In [ ]:
# Create a plot and define its size.
plt.figure(figsize=(12, 10))
# Draw a seaborn boxplot based on the Adventure genre and production budgets
sns.boxplot(x=clean_df["year"],
            y=clean_df['domestic_gross'], palette="Set2")
# Set title of plot
plt.title('Distribution of Domestic Gross by Year')
# Set x-axis label and font size
plt.xlabel('Action,Adventure,Sci-Fi Genre', fontsize=15)
# Set y-axis label
plt.ylabel('Domestic Gross in USD')
# Remove scientific notation from y-axis tick labels
plt.ticklabel_format(style='plain', axis='y')

# Show the plot
plt.show()

In [ ]:
######################################################################################################################
######################################################################################################################

In [ ]:
# Import library as pg
import pingouin as pg
# Perform a hypothesis testing
(
pg.pairwise_corr(clean_df,
        columns = ["cement", "water", "strength", "superplastic"],
        method = 'pearson')
  .round(3)
)

In [ ]:
# Step 1: Initiating a fig and axis object
fig, ax = plt.subplots(figsize = (12, 10))
# Step 2: Create a plot
cax = ax.imshow(cor_df.values, interpolation='nearest', cmap = 'Blues', vmin = -1, vmax = 1)
# Step 3: Set axis tick labels 
ax.set_xticks(ticks = range(len(clean_df.columns)),
              labels = clean_df.columns)
ax.set_yticks(ticks = range(len(clean_df.columns)),
              labels = clean_df.columns)
# Step 4: Resize the tick parameters
ax.tick_params(axis = "x", labelsize = 12, labelrotation = 90)
ax.tick_params(axis = "y", labelsize = 12, labelrotation = 0)
# Step 5: Adding a color bar
fig.colorbar(cax).ax.tick_params(labelsize = 12)
# Step 6: Add annotation
for (x, y), t in np.ndenumerate(cor_df):
    ax.annotate("{:.2f}".format(t),
                 xy = (x, y),
                 va = "center", # vertical position
                 ha = "center") # horizontal position

In [ ]:
pip install association_metrics   # correlation/association & plot
pip install dython                # Correlation/association & plot
pip install pingouin              # Hypothesis testing

In [ ]:
rt_movie_info_df = pd.read_csv('zippedData/rt.movie_info.tsv.gz', sep = '\t')
print(len(rt_movie_info_df))
rt_movie_info_df.head()

In [ ]:

rt_review=pd.read_csv('rt.reviews.tsv.gz',sep='\t', encoding='latin_1') 
rt_review.columns #Columns: id', 'review', 'rating', 'fresh', 'critic', 'top_critic', 'publisher','date'

In [ ]:
rt_review.head()

In [ ]:
# Merge imdb data
rt_df = pd.merge(left=rt_review, right=rt_movie_info_df, on="id")
rt_df.head()

In [ ]:
rt_df["rating_x"].unique()

In [ ]:
rt_df["rating_x"].nunique()

In [ ]:
type(rt_df["box_office"][0])

In [ ]:
rt_df["box_office"] = rt_df["box_office"].str.replace(
    ',', '')

In [ ]:
rt_df.head()

In [ ]:
rt_df["box_office"] = rt_df["box_office"].apply(pd.to_numeric)

In [ ]:
rt_df.head()

In [ ]:
bo_avg_fresh_df = rt_df.groupby('fresh', as_index=False)['box_office'].mean()
bo_avg_fresh_df

In [ ]:
fresh_mean = bo_avg_fresh_df["box_office"][0]
print(fresh_mean)
rotten_mean = bo_avg_fresh_df["box_office"][1]
print(rotten_mean)

In [ ]:
missing_mask = rt_review["rating"].isna()
mapping_dict = dict({'fresh': fresh_mean, 'rotten': rotten_mean})
rt_review.loc[missing_mask, 'rating'] = rt_review.loc[missing_mask, 'fresh'].map(mapping_dict)
rt_review['rating'] = rt_review['rating'].fillna('Medium')
rt_review.head()

In [ ]:
mean_val = rt_df.groupby("fresh")["box_office"].transform("mean")
mean_val

In [ ]:
rt_df.head()

In [ ]:
fake_dataframe = pd.DataFrame({
    'Outlet_Size' : ['Medium', 'Medium', 'Medium', np.nan, 'High', 'High', np.nan, 'Small', 'Medium', 'Small', np.nan, np.nan],
    'sales_bin': ['3000-4000', '0-1000', '2000-3000', '0-1000', '0-1000', '2000-3000', '0-1000', '1000-2000', '1000-2000', '0-1000', '2000-3000', '1000-2000']
})
missing_mask = fake_dataframe['Outlet_Size'].isna()
mapping_dict = dict({'0-1000': 'Small'})
fake_dataframe.loc[missing_mask, 'Outlet_Size'] = fake_dataframe.loc[missing_mask, 'sales_bin'].map(mapping_dict)
fake_dataframe['Outlet_Size'] = fake_dataframe['Outlet_Size'].fillna('Medium')
print(fake_dataframe)

In [ ]:
# Create lists of the seasons with months as elements
poor rating = [11, 12]
long_rain = [3, 4, 5]
short_dry = [1, 2]
long_dry = [6, 7, 8, 9, 10]

In [ ]:
# Create lists of the seasons with months as elements
short_rain = [11, 12]
long_rain = [3, 4, 5]
short_dry = [1, 2]
long_dry = [6, 7, 8, 9, 10]

# Create a function that bins the months reported by season
def season(mon):
    """
    Takes in month, and applies in logical to determine season of sale.
    """
    if mon in short_rain:
        return 'short_rain'
    elif mon in long_rain:
        return 'long_rain'
    elif mon in short_dry:
        return 'short_dry'
    else:
        return 'long_dry'

# Create new feature based on the values returned from function
train_df['seas_recorded'] = train_df['month_recorded'].apply(season)

In [ ]:
rt_movie_info_df = pd.read_csv('zippedrt.reviews.tsv.gz', sep = '\t')
print(len(rt_movie_info_df))
rt_movie_info_df.head()